# BuiltInFailures.KeyBasedTreeEntryFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeyBasedTreeEntryFailures Class
BuiltInFailures Class Members See Also
---
Failures about KeyBasedTreeEntry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class KeyBasedTreeEntryFailures
```

Visual Basic
---
```text
Public NotInheritable Class KeyBasedTreeEntryFailures
```

Visual C++
---
```text
public ref class KeyBasedTreeEntryFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..KeyBasedTreeEntryFailures
# See Also
BuiltInFailures..::..KeyBasedTreeEntryFailures Members
Autodesk.Revit.DB Namespace